In [34]:
import pandas as pd
import numpy as np

# Series

**1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module. => [2, 4, 6, 8, 10]**

In [5]:
data = [2, 4, 6, 8, 10]
s = pd.Series(data)
s

0     2
1     4
2     6
3     8
4    10
dtype: int64

**2. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.** 

   **Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]**

In [20]:
d1 = np.arange(2, 12, 2)
d2 = np.arange(1, 11, 2)
s1 = pd.Series(d1)
s2 = pd.Series(d2)

print("ADD : S1 + S2")
print("-------------")
print(s1 + s2)
print()

print("SUB : S1 - S2")
print("-------------")
print(s1 - s2)
print()

print("MUL : S1 * S2")
print("-------------")
print(s1 * s2)
print()

print("DIV : S1 / S2")
print("-------------")
print(s1 / s2)

ADD : S1 + S2
-------------
0     3
1     7
2    11
3    15
4    19
dtype: int32

SUB : S1 - S2
-------------
0    1
1    1
2    1
3    1
4    1
dtype: int32

MUL : S1 * S2
-------------
0     2
1    12
2    30
3    56
4    90
dtype: int32

DIV : S1 / S2
-------------
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

**3. Write a Pandas program to compare the elements of the two Pandas Series.**
   
   **Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 10]**

In [40]:
d1 = np.arange(2, 12, 2)
d2 = np.arange(1, 11, 2)
s1 = pd.Series(d1)
s2 = pd.Series(d2)

print("> : S1 > S2")
print("-------------")
print(s1 > s2)
print()

print("< : S1 < S2")
print("-------------")
print(s1 < s2)
print()

print("== : S1 == S2")
print("-------------")
print(s1 == s2)
print()

print("!= : S1 != S2")
print("-------------")
print(s1 != s2)

> : S1 > S2
-------------
0    True
1    True
2    True
3    True
4    True
dtype: bool

< : S1 < S2
-------------
0    False
1    False
2    False
3    False
4    False
dtype: bool

== : S1 == S2
-------------
0    False
1    False
2    False
3    False
4    False
dtype: bool

!= : S1 != S2
-------------
0    True
1    True
2    True
3    True
4    True
dtype: bool

**4. Write a Pandas program to add some data to an existing Series.**

   **Sample Series: ['100', '200', 'python', '300.12', '400'], ['500', 'php'] (Object)**

In [42]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['500', 'php'])

d = pd.concat([s1, s2])
d

0       100
1       200
2    python
3    300.12
4       400
0       500
1       php
dtype: object

**5. Write a Pandas program to create a subset of a given series based on value and condition.**

**Sample Series : input [0,1,2,3,4,5,6,7,8,9,10] - value 6 -> output [0,1,2,3,4,5]**

In [44]:
d1 = [0,1,2,3,4,5,6,7,8,9,10]
s1 = pd.Series(d1)
s1[:6]

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [50]:
s1[s1 < 6]

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [38]:
s = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s)
print("\nData Series after adding some data:")
new_s = s.append(pd.Series(['500', 'php']))
print(new_s)
new_s[3] = 999
print(new_s)
print(s)

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object

Data Series after adding some data:
0       100
1       200
2    python
3    300.12
4       400
0       500
1       php
dtype: object
0       100
1       200
2    python
3       999
4       400
0       500
1       php
dtype: object
0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [55]:
data = [['Alex',10],['Bob',12]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

   Name  Age
0  Alex   10
1   Bob   12

# Dataframes

6. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

Sample DataFrame:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [133]:
exam_data  ={
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [134]:
df = pd.DataFrame(data=exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

7. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [66]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [67]:
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [68]:
df[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

8. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [73]:
df[df['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [74]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

9. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [79]:
df[(df['attempts'] < 2) & (df['score'] > 15.0)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

10. Write a Pandas program to change the score in row 'd' to 11.5.

In [102]:
df['score']['d'] = 11.5

<ipython-input-102-c0b90f4183b6>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['score']['d'] = 11.5

In [103]:
df['score'].loc['d'] = 6

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [105]:
df.loc['d', 'score'] = 99

In [106]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   99.0         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

11. Write a Pandas program to replace the ‘qualify' column contains the values 'yes' and 'no' with True and False.

In [136]:
df['qualify'] = df['qualify'].map({'yes' : True, 'no' : False})

In [126]:
df['qualify'] = df['qualify'].replace(True, 'yes')
df['qualify'] = df['qualify'].replace(False, 'no')

In [137]:
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

12. Write a Pandas program to replace the ‘qualify' column contains the values 'yes' and 'no' with True and False. (skip ex. 12 -> 11=12)

13. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [131]:
df.pop('attempts')

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: attempts, dtype: int64

In [138]:
del df['attempts']

In [141]:
df

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

14. Write a Pandas program to insert a new column in existing DataFrame.

In [142]:
df.shape

(10, 3)

In [153]:
df['new_column'] = np.zeros(10)

In [148]:
df['new_column'] = np.ones(10)

In [151]:
df['new_column'] = np.full(10, 5)

In [154]:
df

        name  score  qualify  new_column
a  Anastasia   12.5     True         0.0
b       Dima    9.0    False         0.0
c  Katherine   16.5     True         0.0
d      James    NaN    False         0.0
e      Emily    9.0    False         0.0
f    Michael   20.0     True         0.0
g    Matthew   14.5     True         0.0
h      Laura    NaN    False         0.0
i      Kevin    8.0    False         0.0
j      Jonas   19.0     True         0.0

15. Write a Pandas program to rename columns of a given DataFrame.

In [155]:
df.rename(columns={'new_column' : 'n_column'})

        name  score  qualify  n_column
a  Anastasia   12.5     True       0.0
b       Dima    9.0    False       0.0
c  Katherine   16.5     True       0.0
d      James    NaN    False       0.0
e      Emily    9.0    False       0.0
f    Michael   20.0     True       0.0
g    Matthew   14.5     True       0.0
h      Laura    NaN    False       0.0
i      Kevin    8.0    False       0.0
j      Jonas   19.0     True       0.0